In [1]:
import pandas as pd

In [2]:
data = [
    [2,45,32,10],
    [23,12,40,39]
]
df=pd.DataFrame(data , columns= ['A','B','C' , 'D'])

In [3]:
df

    A   B   C   D
0   2  45  32  10
1  23  12  40  39

In [4]:
df + 10

    A   B   C   D
0  12  55  42  20
1  33  22  50  49

In [5]:
df - 10

    A   B   C   D
0  -8  35  22   0
1  13   2  30  29

In [6]:
df * 10

     A    B    C    D
0   20  450  320  100
1  230  120  400  390

In [7]:
df / 10

     A    B    C    D
0  0.2  4.5  3.2  1.0
1  2.3  1.2  4.0  3.9

In [8]:
df.add(10)

    A   B   C   D
0  12  55  42  20
1  33  22  50  49

In [9]:
df.sub(10)

    A   B   C   D
0  -8  35  22   0
1  13   2  30  29

In [10]:
df.mul(10)

     A    B    C    D
0   20  450  320  100
1  230  120  400  390

In [11]:
df.div(10)

     A    B    C    D
0  0.2  4.5  3.2  1.0
1  2.3  1.2  4.0  3.9

In [12]:
df.mod(10)

   A  B  C  D
0  2  5  2  0
1  3  2  0  9

In [13]:
df % 10

   A  B  C  D
0  2  5  2  0
1  3  2  0  9

In [14]:
df1 = pd.DataFrame([[12,4,5,2]])

In [15]:
df1

    0  1  2  3
0  12  4  5  2

In [16]:
df + df1

    A   B   C   D   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN

In [17]:
df1 = pd.DataFrame([[12,4,5,2]] ,columns= ['A','B','C' , 'D'])

In [18]:
df1 + df

      A     B     C     D
0  14.0  49.0  37.0  12.0
1   NaN   NaN   NaN   NaN

In [19]:
df1 = pd.DataFrame([[12,4,5,2] ,[3,3,23 ,33]] , columns= ['A','B','C' , 'D'] )

In [20]:
df + df1

    A   B   C   D
0  14  49  37  12
1  26  15  63  72

In [21]:
df.add(df1)

    A   B   C   D
0  14  49  37  12
1  26  15  63  72

In [23]:
df.sub(df1)

    A   B   C  D
0 -10  41  27  8
1  20   9  17  6

In [24]:
df1.sub(df)

    A   B   C  D
0  10 -41 -27 -8
1 -20  -9 -17 -6

In [25]:
df.mul(df1)

    A    B    C     D
0  24  180  160    20
1  69   36  920  1287

In [26]:
df1.div(df1)

     A    B    C    D
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0

In [27]:
df.mod(df1)

   A  B   C  D
0  2  1   2  0
1  2  0  17  6